# -*- coding: utf-8 -*-
pool_new = ['15', '诺艾尔']
pool_up = [
        '8', '香菱',
        '9', '笛剑',
        '8', '芭芭拉', '香菱',
        '8', '西风枪',
        '2', '香菱',
        '8', '祭礼弓',
        '9', '芭芭拉',
        '1', '芭芭拉',
        '9', '绝弦',
        '7', '5温蒂', '行秋',
        '8', '香菱',
        '2', '诺艾尔',
        '9', '祭礼大剑',
        '8', '砂糖',
        '5', '砂糖',
        '9', '猫',
        '7', '猫',
        '8', '绝弦',
        '9', '凝光',
        '4', '5钟离',
        '4', '辛焱',
        '8', '雷泽',
        '8', '5迪卢克', '西风弓',
        '7', '5阿贝多',
        '1', '班尼特',
        '8', '菲谢尔', '7']
pool_weapon = [
        '7', '诺艾尔',
        '7', '绝弦',
        '7', '绝弦',
        '1', '西风大剑',
        '5', '5天空枪',
        '1', '西风剑',
        '5', '西风枪',
        '8', '西风剑',
        '7', '西风剑',
        '5', '西风枪',
        '4', '西风枪',
        '3']
pool_normal = [
        '西风枪',
        '1', '雷泽', '昭心',
        '9', '重云',
        '1', '重云',
        '5天空大剑',
        '8', '西风大剑',
        '9', '重云',
        '8', '昭心',
        '8', '凯亚',
        '3', '班尼特',
        '8', '西风书',
        '8', '行秋',
        '9', '祭礼弓',
        '6', '5刻晴',
        '1', '行秋', '9']

print "ref 5s: 1.6%  4s: 13%"
t3, t4, t5 = 0 , 0 ,0 
for pool in [pool_new, pool_up, pool_weapon,  pool_normal]:
    s5, s4, s3 = [0, 0, 0]
    for item in pool:
        if item.isdigit():
            s3 += int(item)
        else:
            if item[0].isdigit():
                s5 += 1
            else:
                s4 += 1
    t3 += s3
    t4 += s4
    t5 += s5
    s = s3+s4+s5
    print s
    print "s3 %d\t %.2f%%" % (s3, s3*100.0/s)
    print "s4 %d\t %.2f%%" % (s4, s4*100.0/s)
    print "s5 %d\t %.2f%%" % (s5, s5*100.0/s)

t = t3+t4+t5
print t
print "t3 %d\t %.2f%%" % (t3, t3*100.0/t)
print "t4 %d\t %.2f%%" % (t4, t4*100.0/t)
print "t5 %d\t %.2f%%" % (t5, t5*100.0/t)
